2018/msisdn.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-12-28 周五 23:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>移动台国际用户识别码</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">移动台国际用户识别码</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org71a485a">1. 前言</a></li>
<li><a href="#orgd4bfdaa">2. 起因</a></li>
<li><a href="#orgd2b9fba">3. MSISDN</a></li>
<li><a href="#orga39f89a">4. 国内号码结构</a></li>
<li><a href="#org6c4d86e">5. 正则表达式</a></li>
<li><a href="#org83bec70">6. 结尾</a></li>
<li><a href="#org580abe1">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org71a485a" class="outline-2">
<h2 id="org71a485a"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
作为今年的最后一篇博客，本来是准备写 <b>Dijkstra 单源最短路径算法</b> 的，但是计划赶不上变化，
只能留在明年了。
</p>

<p>
为了不让最后一篇博客泡汤，还是决定写一篇简单的、短的博客 - 关于移动台国际用户识别码。
</p>

<p>
也就是常说的 <b>手机号码</b>.
</p>
</div>
</div>

<div id="outline-container-orgd4bfdaa" class="outline-2">
<h2 id="orgd4bfdaa"><span class="section-number-2">2</span> 起因</h2>
<div class="outline-text-2" id="text-2">
<p>
移动台国际用户识别码这个东西应该是通信工程要学的东西，和我是没啥关系的。
</p>

<p>
然而，由于这学期连续的外卖生涯，让我想到了一个问题：
</p>
<ul class="org-ul">
<li>为啥取外卖的时候只需要手机号码的 <b>后四位</b> 就够了呢？</li>
</ul>

<p>
这是一个很严肃的问题，难道就不担心重复的问题吗？
</p>

<p>
然后就去网上查了一下相关的资料，发现，这样做是没有问题的，或者说，发生问题的可能性很低很低！
</p>
</div>
</div>

<div id="outline-container-orgd2b9fba" class="outline-2">
<h2 id="orgd2b9fba"><span class="section-number-2">3</span> MSISDN</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>MSISDN</code> 就是移动台国际用户识别码的缩写，和身份证号码一样，它可以通过号码中不同的区段来区分你所在的国家、地区，
同时也可以标识该号码的服务提供商以及你的用户代码。
</p>

<p>
<code>MSISDN</code> 的基本结构划分如下：
</p>
<pre class="example">
MSISDN = CC + NDC + SN
</pre>

<p>
各部分的含义如下：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">例子</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>CC</code></td>
<td class="org-left">国家代码，用于标识该号码所在国家，拨打国内号码时可以省略</td>
<td class="org-left">中国 +86</td>
</tr>

<tr>
<td class="org-left"><code>NDC</code></td>
<td class="org-left">国家目的地代码，用于标识该号码所在地</td>
<td class="org-left">略</td>
</tr>

<tr>
<td class="org-left"><code>SN</code></td>
<td class="org-left">用户号码，用于标识用户</td>
<td class="org-left">略</td>
</tr>
</tbody>
</table>

<p>
其中， <code>CC</code> 是由国际上统一决定的，通常为 <code>1-3</code> 位，而 <code>NDC</code> 和 <code>SN</code> 就由各个国家自己制定了。
</p>

<p>
其他国家怎么制定的我不了解，了解了也没有用，因此简单了解一下国内的结构就行了。
</p>
</div>
</div>

<div id="outline-container-orga39f89a" class="outline-2">
<h2 id="orga39f89a"><span class="section-number-2">4</span> 国内号码结构</h2>
<div class="outline-text-2" id="text-4">
<p>
现在国内的手机号码通常为 <code>11</code> 位（省略国家代码），其中 <code>NDC</code> 占 <code>7</code> 位，由 <b>MAC</b> 和 <b>HLR</b> 组成，
剩下的就是 <code>4</code> 位的 <code>SN</code> 了。
</p>

<p>
<b>MAC</b> 是 <b>移动接入码</b>, 通常为 <code>3</code> 位数字，比如 133、176、183 这些。
</p>

<p>
而 <b>HLR</b> 标识了该号码的 <b>归属地</b>, 由 <b>运营商</b> 统一分配，通常为 <code>4</code> 位数字。
</p>

<p>
最后的 <code>4</code> 为数字代表的就是 <b>用户号码</b> 了，在同一 <b>MAC</b> 和 <b>HLR</b> 是不会重复的。
</p>

<p>
这里也就说明了为什么取外卖只需要手机号码后四位了，因为同一个区域下的 <code>SN</code> 基本是不可能重复的。
</p>
</div>
</div>

<div id="outline-container-org6c4d86e" class="outline-2">
<h2 id="org6c4d86e"><span class="section-number-2">5</span> 正则表达式</h2>
<div class="outline-text-2" id="text-5">
<p>
通过 <code>Python</code>, 我们可以简单的尝试匹配国内手机号码：
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span style="font-weight: bold;">import</span> re

In [2]: <span style="font-weight: bold; font-style: italic;">pt</span> = re.<span style="font-weight: bold;">compile</span>(r<span style="font-style: italic;">'(?P&lt;MAC&gt;\d{3})\s?(?P&lt;HLR&gt;\d{4})\s?(?P&lt;SN&gt;\d{4})'</span>)

In [3]: pt.match(<span style="font-style: italic;">'133 3129 6636'</span>).groupdict()
Out[3]: {<span style="font-style: italic;">'HLR'</span>: <span style="font-style: italic;">'3129'</span>, <span style="font-style: italic;">'MAC'</span>: <span style="font-style: italic;">'133'</span>, <span style="font-style: italic;">'SN'</span>: <span style="font-style: italic;">'6636'</span>}
</pre>
</div>

<p>
emmmm, 结果的顺序似乎不是很完美&#x2026;&#x2026;
</p>
</div>
</div>

<div id="outline-container-org83bec70" class="outline-2">
<h2 id="org83bec70"><span class="section-number-2">6</span> 结尾</h2>
<div class="outline-text-2" id="text-6">
<p>
博客中只是简单的介绍了国内号码的结果，而且还没有加上国家代码，实际使用中可能还要考虑跨区拨号的问题。
</p>

<p>
这些问题是博客里没有提及的，有兴趣的可以去了解一下。
</p>
</div>
</div>

<div id="outline-container-org580abe1" class="outline-2">
<h2 id="org580abe1"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/MSISDN">MSISDN - Wikipedia</a></li>
<li><a href="https://baike.baidu.com/item/%E6%89%8B%E6%9C%BA%E5%8F%B7%E7%A0%81">手机号码_百度百科</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
